{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "45f6f2f1-bc34-4a7f-8d77-a2060dcabdb7",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "c78306e6-c6a4-436e-99b7-1d51b3e5ebb6",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Read in biomedical benchmark (disease to drug explanations)\n",
    "bmb = pd.read_csv('../data/biomedical_benchmark/drugmechdb_hetnet_disease_explanations.tsv', sep='\\t')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "1b27826d-4a4a-4738-bbae-de8db4c48967",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Initialize client for HetNet Neo4j\n",
    "bolt = 'bolt://neo4j.het.io:7687'\n",
    "driver = GraphDatabase.driver(bolt)\n",
    "sess = driver.session()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "2d277aac-0509-4607-83da-aef1313e2cab",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_gene_counts(drug_id, disease_id, sess):\n",
    "    q = f'''\n",
    "    MATCH (c:Compound) WHERE c.identifier = '{drug_id}'\n",
    "    MATCH (c)-[:BINDS_CbG]-(g1:Gene)\n",
    "    WITH c, count(distinct g1) as drug_gene_ct\n",
    "    MATCH (d:Disease) WHERE d.identifier='{disease_id}' \n",
    "    MATCH (d)-[:ASSOCIATES_DaG]-(g2:Gene)\n",
    "    WITH c, drug_gene_ct, d, count(distinct g2) as dx_gene_ct\n",
    "    MATCH p=(c)-[:BINDS_CbG]-(g3:Gene)-[:ASSOCIATES_DaG]-(d)\n",
    "    RETURN c.name, drug_gene_ct, d.name, dx_gene_ct, count(distinct g3) as shared_gene_ct\n",
    "    '''\n",
    "    return sess.run(q)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "aec92629-ebf5-46d6-b20b-c239681f35be",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "skipping 2\n",
      "skipping 3\n",
      "skipping 11\n",
      "skipping 26\n",
      "skipping 27\n",
      "skipping 29\n",
      "skipping 31\n",
      "skipping 37\n"
     ]
    }
   ],
   "source": [
    "result_rows = []\n",
    "for i, row in bmb.iterrows():\n",
    "    drug_id = row.drug_id_hetnet[10:]\n",
    "    disease_id = row.outcome_id_hetnet[9:]\n",
    "    out = get_gene_counts(drug_id, disease_id, sess)\n",
    "    keys = out.keys()\n",
    "    values = out.values()\n",
    "    if len(values)==1:\n",
    "        result = dict(zip(keys,values[0]))\n",
    "        result_rows.append(result)\n",
    "    else:\n",
    "        print(f'skipping {i}')\n",
    "all_counts = pd.DataFrame(result_rows)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "59a566c9-5646-43be-90f7-b6f9b99d67c5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>c.name</th>\n",
       "      <th>drug_gene_ct</th>\n",
       "      <th>d.name</th>\n",
       "      <th>dx_gene_ct</th>\n",
       "      <th>shared_gene_ct</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Ziprasidone</td>\n",
       "      <td>34</td>\n",
       "      <td>schizophrenia</td>\n",
       "      <td>235</td>\n",
       "      <td>15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Eletriptan</td>\n",
       "      <td>14</td>\n",
       "      <td>migraine</td>\n",
       "      <td>46</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Venlafaxine</td>\n",
       "      <td>11</td>\n",
       "      <td>panic disorder</td>\n",
       "      <td>16</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Amoxapine</td>\n",
       "      <td>23</td>\n",
       "      <td>endogenous depression</td>\n",
       "      <td>33</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Citalopram</td>\n",
       "      <td>14</td>\n",
       "      <td>endogenous depression</td>\n",
       "      <td>33</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Dexfenfluramine</td>\n",
       "      <td>9</td>\n",
       "      <td>obesity</td>\n",
       "      <td>373</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Pimozide</td>\n",
       "      <td>23</td>\n",
       "      <td>Gilles de la Tourette syndrome</td>\n",
       "      <td>16</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Prochlorperazine</td>\n",
       "      <td>7</td>\n",
       "      <td>schizophrenia</td>\n",
       "      <td>235</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Amantadine</td>\n",
       "      <td>14</td>\n",
       "      <td>Parkinson's disease</td>\n",
       "      <td>143</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Venlafaxine</td>\n",
       "      <td>11</td>\n",
       "      <td>panic disorder</td>\n",
       "      <td>16</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Amoxapine</td>\n",
       "      <td>23</td>\n",
       "      <td>endogenous depression</td>\n",
       "      <td>33</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Metolazone</td>\n",
       "      <td>7</td>\n",
       "      <td>hypertension</td>\n",
       "      <td>496</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Polythiazide</td>\n",
       "      <td>1</td>\n",
       "      <td>hypertension</td>\n",
       "      <td>496</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Hydrochlorothiazide</td>\n",
       "      <td>9</td>\n",
       "      <td>hypertension</td>\n",
       "      <td>496</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Indapamide</td>\n",
       "      <td>11</td>\n",
       "      <td>hypertension</td>\n",
       "      <td>496</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Eletriptan</td>\n",
       "      <td>14</td>\n",
       "      <td>migraine</td>\n",
       "      <td>46</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Aminoglutethimide</td>\n",
       "      <td>5</td>\n",
       "      <td>breast cancer</td>\n",
       "      <td>540</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Irbesartan</td>\n",
       "      <td>10</td>\n",
       "      <td>hypertension</td>\n",
       "      <td>496</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Spironolactone</td>\n",
       "      <td>11</td>\n",
       "      <td>hypertension</td>\n",
       "      <td>496</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Eletriptan</td>\n",
       "      <td>14</td>\n",
       "      <td>migraine</td>\n",
       "      <td>46</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Eletriptan</td>\n",
       "      <td>14</td>\n",
       "      <td>migraine</td>\n",
       "      <td>46</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Terbutaline</td>\n",
       "      <td>2</td>\n",
       "      <td>asthma</td>\n",
       "      <td>222</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Terbutaline</td>\n",
       "      <td>2</td>\n",
       "      <td>asthma</td>\n",
       "      <td>222</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Amoxapine</td>\n",
       "      <td>23</td>\n",
       "      <td>endogenous depression</td>\n",
       "      <td>33</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Entacapone</td>\n",
       "      <td>2</td>\n",
       "      <td>Parkinson's disease</td>\n",
       "      <td>143</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Chlorthalidone</td>\n",
       "      <td>10</td>\n",
       "      <td>hypertension</td>\n",
       "      <td>496</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Clonidine</td>\n",
       "      <td>18</td>\n",
       "      <td>hypertension</td>\n",
       "      <td>496</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Clonidine</td>\n",
       "      <td>18</td>\n",
       "      <td>attention deficit hyperactivity disorder</td>\n",
       "      <td>41</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Canagliflozin</td>\n",
       "      <td>9</td>\n",
       "      <td>type 2 diabetes mellitus</td>\n",
       "      <td>275</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Nifedipine</td>\n",
       "      <td>25</td>\n",
       "      <td>hypertension</td>\n",
       "      <td>496</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Chlorothiazide</td>\n",
       "      <td>5</td>\n",
       "      <td>hypertension</td>\n",
       "      <td>496</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Phenytoin</td>\n",
       "      <td>21</td>\n",
       "      <td>epilepsy syndrome</td>\n",
       "      <td>399</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 c.name  drug_gene_ct  \\\n",
       "0           Ziprasidone            34   \n",
       "1            Eletriptan            14   \n",
       "2           Venlafaxine            11   \n",
       "3             Amoxapine            23   \n",
       "4            Citalopram            14   \n",
       "5       Dexfenfluramine             9   \n",
       "6              Pimozide            23   \n",
       "7      Prochlorperazine             7   \n",
       "8            Amantadine            14   \n",
       "9           Venlafaxine            11   \n",
       "10            Amoxapine            23   \n",
       "11           Metolazone             7   \n",
       "12         Polythiazide             1   \n",
       "13  Hydrochlorothiazide             9   \n",
       "14           Indapamide            11   \n",
       "15           Eletriptan            14   \n",
       "16    Aminoglutethimide             5   \n",
       "17           Irbesartan            10   \n",
       "18       Spironolactone            11   \n",
       "19           Eletriptan            14   \n",
       "20           Eletriptan            14   \n",
       "21          Terbutaline             2   \n",
       "22          Terbutaline             2   \n",
       "23            Amoxapine            23   \n",
       "24           Entacapone             2   \n",
       "25       Chlorthalidone            10   \n",
       "26            Clonidine            18   \n",
       "27            Clonidine            18   \n",
       "28        Canagliflozin             9   \n",
       "29           Nifedipine            25   \n",
       "30       Chlorothiazide             5   \n",
       "31            Phenytoin            21   \n",
       "\n",
       "                                      d.name  dx_gene_ct  shared_gene_ct  \n",
       "0                              schizophrenia         235              15  \n",
       "1                                   migraine          46               5  \n",
       "2                             panic disorder          16               1  \n",
       "3                      endogenous depression          33               6  \n",
       "4                      endogenous depression          33               3  \n",
       "5                                    obesity         373               3  \n",
       "6             Gilles de la Tourette syndrome          16               3  \n",
       "7                              schizophrenia         235               4  \n",
       "8                        Parkinson's disease         143               5  \n",
       "9                             panic disorder          16               1  \n",
       "10                     endogenous depression          33               6  \n",
       "11                              hypertension         496               2  \n",
       "12                              hypertension         496               1  \n",
       "13                              hypertension         496               2  \n",
       "14                              hypertension         496               3  \n",
       "15                                  migraine          46               5  \n",
       "16                             breast cancer         540               2  \n",
       "17                              hypertension         496               3  \n",
       "18                              hypertension         496               5  \n",
       "19                                  migraine          46               5  \n",
       "20                                  migraine          46               5  \n",
       "21                                    asthma         222               1  \n",
       "22                                    asthma         222               1  \n",
       "23                     endogenous depression          33               6  \n",
       "24                       Parkinson's disease         143               1  \n",
       "25                              hypertension         496               3  \n",
       "26                              hypertension         496               7  \n",
       "27  attention deficit hyperactivity disorder          41               2  \n",
       "28                  type 2 diabetes mellitus         275               4  \n",
       "29                              hypertension         496               4  \n",
       "30                              hypertension         496               1  \n",
       "31                         epilepsy syndrome         399              10  "
      ]
     },
     "execution_count": 59,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "all_counts"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
